app/controllers/infantries_controller.rb

  def index
    @infantries = Infantry.all
---
SELECT "infantries".* FROM "infantries"

  def create
    @infantry = Infantry.new(infantry_params)

    if @infantry.save
---
INSERT INTO "infantries" ("inf_attack", "inf_defense", "inf_health", "inf_attack_vs_player", "inf_defense_vs_player", "inf_health_vs_player", "inf_attack_vs_players_inf", "inf_attack_vs_players_range", "inf_attack_vs_players_cav", "inf_defense_vs_players_cav", "inf_defense_vs_players_inf", "inf_defense_vs_players_range", "inf_defense_vs_players_siege", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"

  def update
    if @infantry.update(infantry_params)
---
UPDATE "infantries" SET "inf_attack" = $1, "updated_at" = $2 WHERE "infantries"."id" = $3  [["inf_attack", "215.969"], ["updated_at", "2022-01-14 04:26:26.607957"], ["id", 5]]

  def destroy
    @infantry.destroy
---
DELETE FROM "infantries" WHERE "infantries"."id" = $1  [["id", 5]]

    def set_infantry
      @infantry = Infantry.find(params[:id])
---
SELECT "infantries".* FROM "infantries" WHERE "infantries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]