app/controllers/infantries_controller.rb

SELECT "infantries".* FROM "infantries" WHERE "infantries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    render json: Infantry.find(params[:id])

SELECT "infantries".* FROM "infantries" WHERE "infantries"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def update
    infantry = Infantry.find(params[:id])