app/controllers/rangeds_controller.rb

  def index
    @rangeds = Ranged.all
---
SELECT "rangeds".* FROM "rangeds"